{"data":{"markdownRemark":{"html":"<p>Devices are ancient artefacts that possess great power. They act as spells, providing the wielder with extraordinary abilities. Devices are partly alive.</p>\n<h2>Device Tier</h2>\n<p>Devices have a tier of 1-4. This is the device’s base level of power.</p>\n<h2>Using a Device</h2>\n<p>Devices have an ability, which relies on charges. A Device has a base number of Charge Dice equal to its tier, and you roll these when you use the device. The more dice rolled, the more powerful the effect.</p>\n<p>When you use a Device, roll a number of d6’s equal to the Device’s current Charge Dice. The ability of the device will depend on the number of [dice] and/or [sum] of values rolled.</p>\n<p>Charge Dice rolled with a value of 1-3 are returned to the the Device’s charge pool and can be re-used. Dice of value 4-6 are expended, and don’t return to the device until it is recharged.</p>\n<h2>Recharging a device</h2>\n<p>To recharge a Device, expend a charge cell. This resets the Device’s Charge Dice to equal its tier, and takes a number of hours equal to its tier.</p>\n<h3>Overcharging</h3>\n<p>When you charge a Device you may spend additional charge cells, one for one, to add <strong>Overcharge Dice</strong> to the Device. These count as extra Charge Dice the next time the Device is used, but are always expended (roll separately or use a different colour from regular charge dice).</p>\n<h2>Device safety</h2>\n<p>A Device can only be safely wielded by a user of equal or greater level than the Device’s tier.</p>\n<p>If you use a device of greater tier than your level, roll <strong>danger dice</strong> equal to the difference between the values. These do not count towards the device’s effect, but count towards doubles or triples rolled for mishaps and disasters.</p>\n<blockquote>\n<p>Example: Rolf, a level 1 character, attempts to use a tier two <strong>Pusher</strong>. He rolls two <strong>charge dice</strong> and one <strong>danger die</strong>. The charge dice come up 5 &#x26; 3, and a 3 is rolled on the danger die, for a total [sum] of 8 and [dice] of 2. The 3 returns to the device’s charge pool and the 5 is expended. The device also has a Mishap, so Rolf rolls for that before resolving the devices effect.</p>\n</blockquote>\n<h2>Mishaps and disasters</h2>\n<p>When you roll doubles when using a device, it causes a Mishap. When triples (or more) are rolled, it causes a Disaster. Roll on the mishap or disaster tables for the effect.</p>\n<h3>Mishaps</h3>\n<ol>\n<li>All of the Device’s charges are expended</li>\n<li>Wielder takes 1d6 damage</li>\n<li>Wielder takes a random mutation for 1d6 rounds, then Saves. Permanent if failed.</li>\n<li>Device effects another random target within range</li>\n<li>Device is damaged. Cannot be used again until repaired (takes 1d6 hours).</li>\n<li>Device overcharges. For each 1-3 rolled, roll an additional charge die, and add to the devices effect (additional doubles/triples count towards mishaps/disasters). Then expend all device charges.</li>\n</ol>\n<h3>Disasters</h3>\n<ol>\n<li>Device explodes, causing [device tier]d6 damage to all within 10’</li>\n<li>Device is badly damaged. Can only be repaired using the parts of another Device.</li>\n<li>Device causes a reverse effect. Double any  The GM should interpret this maliciously.</li>\n<li>Wielder takes 1d6 random permanent mutations. Save for half.</li>\n</ol>\n<h2>Increasing a Device’s tier</h2>\n<p>A Device’s tier can be increased by using the parts of another Device of equal or greater tier. This destroys the deconstructed device and increases the upgraded device's tier by one.</p>\n<p>The process of upgrading a device takes a number of weeks equal to the device’s new tier. (ie, increasing a device from tier 1 to 2 takes two weeks, from 2 to 3 takes three weeks).</p>\n<h1>Random Devices</h1>\n<h2>Device tier</h2>\n<p>When rolling a random device, roll a d12 for its tier.</p>\n<table>\n<thead>\n<tr>\n<th>d12</th>\n<th>Device tier</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>1</td>\n<td>Tier 0 - has a single charge which is always depleted when used</td>\n</tr>\n<tr>\n<td>2-6</td>\n<td>Tier 1</td>\n</tr>\n<tr>\n<td>7-9</td>\n<td>Tier 2</td>\n</tr>\n<tr>\n<td>10-11</td>\n<td>Tier 3</td>\n</tr>\n<tr>\n<td>12</td>\n<td>Tier 4</td>\n</tr>\n</tbody>\n</table>\n<h2>List of Devices</h2>\n<p>Mostly stolen/adapted from GLOG &#x26; Knave spell lists.</p>\n<h3>1. Friendly Beam</h3>\n<table>\n<thead>\n<tr>\n<th>Range</th>\n<th>Target</th>\n<th>Duration</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>50’ beam</td>\n<td>1 person</td>\n<td>[dice] hour</td>\n</tr>\n</tbody>\n</table>\n<p>Form: Like a flashlight. Button triggers flickering beam of bright pink light. </p>\n<p>Target person regards you as a friend and ignores the obvious effect you used on them. If 4 or more [dice] are used, the effect is permanent.</p>\n<h3>2. Prismo gun</h3>\n<p>Form: Ivory white rifle, bright glowing colours shift underneath<br>\nRange: 15’ cone<br>\nTarget: sighted creatures<br>\nDuration: varies  </p>\n<p>Compare [sum] to creatures HD.</p>\n<ul>\n<li>[sum] ≥ HD: befuddled for 1d6 rounds.</li>\n<li>[sum] ≥ HD x 3: stunned for 1 round, then befuddled for 1d6 rounds.</li>\n<li>[sum] ≥ HD x 5: stunned for 1d6 rounds, then befuddled for 1d6 rounds.</li>\n</ul>\n<h3>3. Brain Switcher</h3>\n<p>Form: Two helmets, linked by a tangle of wires<br>\nRange: touch<br>\nTarget: two creatures that can fit in the helmets<br>\nDuration: [sum] hours  </p>\n<p>The consciousness of the two creatures are swapped. If one of the creatures die while under this effect, the other dies too. If 4 or more [dice] are used, the effect is permanent.</p>\n<h3>4. Death Mask</h3>\n<p>Form: A mask of black iron. Inside of mask is a mass of tiny blades and gears.<br>\nRange: touch<br>\nTarget: fresh humanoid corpse<br>\nDuration: permanent  </p>\n<p>Place onto a corpse’s face. The face is quickly stripped off and can be peeled off the back of the mask. The corpse corpse crumbles into dust.</p>\n<p>When you (and only you) wear the face, you will look and sound like the person who’s face you are wearing, but only to sentient people (no effect on animals, spirits or constructs).</p>\n<p>The face will rot into uselessness after [sum] days.</p>\n<h3>5. Bone Blade</h3>\n<p>Form: A heavy black iron handle, engraved with screaming skulls<br>\nRange: touch<br>\nTarget: corpse<br>\nDuration: [dice] x 30 mins  </p>\n<p>Shove the handle into a corpse. The body crumbles to dust as the bones form themselves into a blade around the handle. This functions as a +1 heavy weapon, and does double damage to creatures of the same type.</p>\n<h3>6. Disguise Projector</h3>\n<p>Form: A glass box, shifting misty forms and colours inside<br>\nRange: touch<br>\nTarget: object<br>\nDuration: [dice] hours  </p>\n<p>Cloak the touched object in illusion, making it appear as another object of the same type. An apple could be disguised as another type of fruit; a table as another type of furniture; a humanoid disguised as any other humanoid of comparable size. This only extends fo visual properties of the object not voice, smell, etc.</p>\n<p>The maximum size of the object depends on [dice]:</p>\n<ul>\n<li>1 die: human sized</li>\n<li>2 dice: ogre or wagon sized</li>\n<li>3 dice: dragon or building sized</li>\n<li>4 dice: ship or bridge sized</li>\n</ul>\n<h3>7. Pusher</h3>\n<p>Form: French horn with pistol stock<br>\nRange: 15’ cone<br>\nTarget: object<br>\nDuration: instant  </p>\n<p>A wave of force blasts an object away from you as if pushed with the strength of [dice] men.</p>\n<h3>8. False Life</h3>\n<p>Form: A long syringe fed by a tattoo machine<br>\nRange: touch<br>\nTarget: creature<br>\nDuration: instant  </p>\n<p>Creature is healed for [sum] x 2 HP, up to [sum] HP higher than their normal maximum HP. Creatures healed this way cannon regain HP by any other means for [dice] days.</p>\n<h3>9. Glue ball</h3>\n<p>Form: A brass ball perforated with holes, on a 1’ handle<br>\nRange: touch<br>\nTarget: object<br>\nDuration: [sum] mins  </p>\n<p>Extremely sticky slime pours from the ball. Once the duration ends, it hardens into a crumbly crust.</p>\n<h3>10. Animator</h3>\n<p>Form: A small gold disc, an antenna ending in a blinking red light in the centre<br>\nRange: touch<br>\nTarget: inanimate object<br>\nDuration: [sum] mins  </p>\n<p>The object becomes animate and will follow your commands to the best of it’s abilities. It can walk at 15’ per round.</p>\n<p>The maximum size of the object depends on [dice]:</p>\n<ul>\n<li>1 die: breadbox</li>\n<li>2 dice: armchair</li>\n<li>3 dice: cart</li>\n<li>4 dice: house</li>\n</ul>\n<h3>11. Memory Mangler</h3>\n<p>Form: A black box, emits a very high-pitched whine on when used<br>\nRange: 30’ radius<br>\nTarget: [dice] people<br>\nDuration: [sum] mins  </p>\n<p>Targets of your choice within range cannot form new short-term memories for the duration.</p>\n<h3>12. Catherine Wheel</h3>\n<p>Form: Dinner-plate sized metal disc, painted with a calm pastoral scene<br>\nRange: 0<br>\nTarget: -<br>\nDuration: [sum] x 10 minutes  </p>\n<p>A woman wearing a blue dress appears. She will obey polite, safe requests.</p>\n<h3>13. Ear Worm</h3>\n<p>Form: A flexible steel maggot<br>\nRange: -<br>\nTarget: person<br>\nDuration: [dice] hours  </p>\n<p>Place this in your ear. You can understand and speak all languages.</p>\n<h3>14. Beast Mask</h3>\n<p>Form: A wooden mask, crudely carved with the face of a beast, a different one each time you look.<br>\nRange: touch<br>\nTarget: person<br>\nDuration: [sum] x 5 minutes  </p>\n<p>The wearer and their possessions takes the form a mundane animal of their choice.</p>\n<h3>15. Portal Gun</h3>\n<p>Form:\nRange:\nTarget:\nDuration:</p>\n<h3>16. Ghost Trap</h3>\n<p>Form: An iron box with vice-like jaw on top<br>\nRange: 15' radius<br>\nTarget: [dice] ghosts or animated spirits<br>\nDuration: instant  </p>\n<p>Targets must Save or become trapped in the device. If [sum] is 8 or greater, the targets Save with disadvantage. The Ghost Trap can hold HD of ghosts equal to Tier x 3.</p>\n<h3>17. Featherweighter</h3>\n<p>Form: An umbrella with ghostly feathers in place of ribs and shade<br>\nRange: touch<br>\nTarget: object<br>\nDuration: [sum] rounds  </p>\n<p>The object's weight (but not mass) drops by 99%. Ignore all falling damage. You can use this on yourself as a reaction.</p>\n<h3>18. Slumber Wand</h3>\n<p>Form: A calmingly soft and fuzzy wand, tipped in a pearly white glass<br>\nRange: 50'<br>\nTarget: creature<br>\nDuration: 10 mins  </p>\n<p>Target falls into a deep sleep, and can't be woken by anything less than a slap. Alert, aware targets may Save to resist. Can affect creatures up to [sum] HD. If [sum] is at least 4 times the creatures HD, the duration is permanent (until slapped), and the creature no longer needs to eat or drink while sleeping.</p>\n<h3>19. Knocker</h3>\n<p>Form: An ornate brass door handle<br>\nRange: touch<br>\nTarget: object<br>\nDuration: instant  </p>\n<p>Object is opened. Doors are flung wide, locks are broken, shackles are bent open, belts come undone. Treat this as a Strength check made with a Strength of 10 + ([dice] x 4). Worn armour falls off if the wearer fails a save. Creatures must save or vomit (a free action).</p>\n<h3>20. Deflector Shield</h3>\n<p>Form: Wide belt, ringed with shimmering and spluttering red projectors<br>\nRange: touch<br>\nTarget: self<br>\nDuration: 2 hours  </p>\n<p>Defence improves to 13 + [dice].</p>\n<h3>21. Disassembler</h3>\n<p>Form: A thick leather and chrome cuff with a bright orange belt strap<br>\nRange: -<br>\nTarget: self<br>\nDuration: [sum] minutes  </p>\n<p>Tighten around a limb. The limb can be painlessly removed from the cuff, and moved/controlled independently of your body (up to a range of 50').</p>\n<p>Make sure your limb is returned to the cuff before the effect ends.</p>\n<h3>22. Displacement Projector</h3>\n<p>Form: A misty snow globe with flickering lightning inside<br>\nRange: [dice] x 10’<br>\nTarget: object<br>\nDuration: [sum] minutes  </p>\n<p>Attach to an object. You may make it appear as if it is up to [dice] x 10' away from its actual location. This only applies to the visual appearance of the object, not touch, smell etc.</p>","frontmatter":{"date":"November 24, 2018","title":"Devices for Knave"}}},"pageContext":{"slug":"/2018-11-24-knave-devices/"}}